АПК/Tasks/Задача.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Task>
		<Properties>
			<Name>Задача</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СостояниеЗадачи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостояниеЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокИсполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Назначающий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗадачаПросрочена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОценкаТрудоемкости</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОценкиТрудоемкости</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Task>
</MetaDataObject>

АПК/Enums/ОценкиТрудоемкости.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ОценкиТрудоемкости</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Быстро</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Средне</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Долго</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

АПК/Enums/СостояниеЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СостояниеЗадач</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗапланированоВБудущем</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КВыполнению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаПроверке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Готово</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Внедрено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

АПК/Catalogs/УчетныеЗаписиTelegram.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>УчетныеЗаписиTelegram</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

АПК/Tasks/Задача/Forms/ФормаЗадачи/Ext/Form/Module.bsl
#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекущийПользователь = ПользователиИнформационнойБазы.ТекущийПользователь().Имя;
	Администратор		= "Добрынин Андрей";
	
	Если РольДоступна("ПолныеПрава") И ТекущийПользователь = Администратор Тогда	
		Элементы.ЗначенияТипаБулево.Видимость = Истина;		
	Иначе 
		Элементы.ЗначенияТипаБулево.Видимость = Ложь;
	КонецЕсли;
	
	Если Объект.Выполнена = Истина Тогда 
		Объект.ЗадачаПросрочена = Ложь;
	КонецЕсли;
	
	ОценкаТрудоемкостиЗадачи = Объект.ОценкаТрудоемкости;
	
	ЗадачаБыстрая = Перечисления.ОценкиТрудоемкости.Быстро;
	ЗадачаСредняя = Перечисления.ОценкиТрудоемкости.Средне;
	ЗадачаДолгая  = Перечисления.ОценкиТрудоемкости.Долго;
	
	Если ОценкаТрудоемкостиЗадачи = ЗадачаБыстрая Тогда 
		
		Элементы.ОценкаТрудоемкости.ЦветРамки = Новый Цвет(12, 220, 64);
		
	ИначеЕсли ОценкаТрудоемкостиЗадачи = ЗадачаСредняя Тогда 
		
		Элементы.ОценкаТрудоемкости.ЦветРамки = Новый Цвет(255, 213, 0);
		
	ИначеЕсли ОценкаТрудоемкостиЗадачи = ЗадачаДолгая Тогда 
		
		Элементы.ОценкаТрудоемкости.ЦветРамки = Новый Цвет(173, 26, 21);
		
	Иначе 
		
		Элементы.ОценкаТрудоемкости.ЦветРамки = Новый Цвет(200, 170, 160);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ВыгрузкаИзЗапроса = ВыполнитьЗапросДляИсполнителя();
	
	Если Объект.Выполнена <> Истина Тогда 
		
		Если ВыгрузкаИзЗапроса.Количество() > 0 Тогда 
			
			Уведомление = "Вам пришла задача!" + Символы.ПС + Объект.Наименование;
			
			МодульTelegram.SendMessage(ВыгрузкаИзЗапроса[0].ID, Уведомление);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПередВыполнениемНаСервере()
	
	ЗадачаВнедрена = Перечисления.СостояниеЗадач.Внедрено;
	
	Возврат ЗадачаВнедрена;
	
КонецФункции

&НаКлиенте
Процедура ПередВыполнением(Отказ)
	
	ЗадачаВнедрена		   = ПередВыполнениемНаСервере();	
	Объект.СостояниеЗадачи = ЗадачаВнедрена; 	
	
	ОтправитьВТелеграм();
	
КонецПроцедуры

&НаСервере
Процедура ОценкаТрудоемкостиПриИзмененииНаСервере()
	
	ОценкаТрудоемкостиЗадачи = Объект.ОценкаТрудоемкости;
	
	ЗадачаБыстрая = Перечисления.ОценкиТрудоемкости.Быстро;
	ЗадачаСредняя = Перечисления.ОценкиТрудоемкости.Средне;
	ЗадачаДолгая  = Перечисления.ОценкиТрудоемкости.Долго;
	
	Если ОценкаТрудоемкостиЗадачи = ЗадачаБыстрая Тогда 
		
		Элементы.ОценкаТрудоемкости.ЦветРамки = Новый Цвет(12, 220, 64);
		
	ИначеЕсли ОценкаТрудоемкостиЗадачи = ЗадачаСредняя Тогда 
		
		Элементы.ОценкаТрудоемкости.ЦветРамки = Новый Цвет(255, 213, 0);
		
	ИначеЕсли ОценкаТрудоемкостиЗадачи = ЗадачаДолгая Тогда 
		
		Элементы.ОценкаТрудоемкости.ЦветРамки = Новый Цвет(173, 26, 21);
		
	Иначе 
		
		Элементы.ОценкаТрудоемкости.ЦветРамки = Новый Цвет(200, 170, 160);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОценкаТрудоемкостиПриИзменении(Элемент)
	ОценкаТрудоемкостиПриИзмененииНаСервере();
КонецПроцедуры

#КонецОбласти

#Область РаботаСДанными

&НаСервере
Процедура ОтправитьВТелеграм()
	
	ВыгрузкаИзЗапроса = ВыполнитьЗапросДляНазначающего();
	
	Уведомление = "Здрваствуйте, " 
	+ МодульВидовТекста.Жирный(Строка(ВыгрузкаИзЗапроса[0].Сотрудник.ИмяОтчество)) 
	+ "! Задача: " + "«" 
	+ МодульВидовТекста.Подчеркнутый(Строка(Объект.Наименование)) 
	+ "»" + ", который выполнил сотрудник " 
	+ МодульВидовТекста.Жирный(Строка(Объект.Исполнитель))
	+ " была внедрена!";
	
	МодульTelegram.SendMessage(ВыгрузкаИзЗапроса[0].ID, Уведомление,, "HTML");
	
КонецПроцедуры

&НаСервере
Функция ВыполнитьЗапросДляИсполнителя() Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УчетныеЗаписиTelegram.ID КАК ID,
	|	УчетныеЗаписиTelegram.Сотрудник КАК Сотрудник
	|ИЗ
	|	Справочник.УчетныеЗаписиTelegram КАК УчетныеЗаписиTelegram
	|ГДЕ
	|	ВЫРАЗИТЬ(УчетныеЗаписиTelegram.Сотрудник КАК Справочник.Сотрудники) В (&Исполнитель)
	|	И НЕ УчетныеЗаписиTelegram.ПометкаУдаления";
	Запрос.УстановитьПараметр("Исполнитель", Объект.Исполнитель);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выгрузка		 = РезультатЗапроса.Выгрузить();
	
	Возврат Выгрузка;
	
КонецФункции

&НаСервере
Функция ВыполнитьЗапросДляНазначающего()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УчетныеЗаписиTelegram.ID КАК ID,
	|	УчетныеЗаписиTelegram.Сотрудник КАК Сотрудник,
	|	УчетныеЗаписиTelegram.Сотрудник.ИмяОтчество КАК СотрудникИмяОтчество
	|ИЗ
	|	Справочник.УчетныеЗаписиTelegram КАК УчетныеЗаписиTelegram
	|ГДЕ
	|	ВЫРАЗИТЬ(УчетныеЗаписиTelegram.Сотрудник КАК Справочник.Сотрудники) В (&Назначающий)
	|	И НЕ УчетныеЗаписиTelegram.ПометкаУдаления";
	Запрос.УстановитьПараметр("Назначающий", Объект.Назначающий);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выгрузка		 = РезультатЗапроса.Выгрузить();
	
	Возврат Выгрузка;
	
КонецФункции

#КонецОбласти
